; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v2 - type_2 ?v4 - type_3)
 	      (pred_3 ?v3 - object ?v4 - type_3)
	      (pred_2 ?v2 - type_2 ?v5 - type_1)
	      (pred_1 ?v2 - type_2 ?v3 - object ?v5 - type_1))

   (:action op_2
       :parameters  (?v2 - type_2 ?v8 ?v1 - type_3)
       :precondition (and  (pred_4 ?v2 ?v8))
       :effect (and  (pred_4 ?v2 ?v1)
		     (not (pred_4 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_2 ?v7 - object ?v6 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v7 ?v6) (pred_4 ?v2 ?v6) (pred_2 ?v2 ?v5))
       :effect (and (pred_1 ?v2 ?v7 ?v5)
		    (not (pred_3 ?v7 ?v6)) 
		    (not (pred_2 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_2 ?v7 - object ?v6 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v7 ?v5) (pred_4 ?v2 ?v6))
       :effect (and (pred_3 ?v7 ?v6)
		    (pred_2 ?v2 ?v5)
		    (not (pred_1 ?v2 ?v7 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_11 - type_2
obj_09 obj_03 obj_10 obj_07 - type_1
obj_01 obj_13 obj_12 obj_02 - type_3
obj_04 obj_08 obj_06 - object)
(:init
(pred_4 obj_05 obj_13)
(pred_2 obj_05 obj_09)
(pred_2 obj_05 obj_03)
(pred_4 obj_11 obj_01)
(pred_2 obj_11 obj_10)
(pred_2 obj_11 obj_07)
(pred_3 obj_04 obj_12)
(pred_3 obj_08 obj_12)
(pred_3 obj_06 obj_12)
)
(:goal
(and
(pred_3 obj_04 obj_01)
(pred_3 obj_08 obj_02)
(pred_3 obj_06 obj_01)
)
)

(:constraints
  (always (not (pred_4 obj_05 obj_12)))
)
)

; plan
1. (op_2 obj_05 obj_13 obj_01)
   deleted: (pred_4 obj_05 obj_13)
   added: (pred_4 obj_05 obj_01)
   goals met: 0 of 3
2. (op_2 obj_11 obj_01 obj_12)
   deleted: (pred_4 obj_11 obj_01)
   added: (pred_4 obj_11 obj_12)
   goals met: 0 of 3
3. (op_3 obj_11 obj_08 obj_12 obj_07)
   deleted: (pred_3 obj_08 obj_12) (pred_2 obj_11 obj_07)
   added: (pred_1 obj_11 obj_08 obj_07)
   goals met: 0 of 3
4. (op_2 obj_11 obj_12 obj_02)
   deleted: (pred_4 obj_11 obj_12)
   added: (pred_4 obj_11 obj_02)
   goals met: 0 of 3
5. (op_1 obj_11 obj_08 obj_02 obj_07)
   deleted: (pred_1 obj_11 obj_08 obj_07)
   added: (pred_3 obj_08 obj_02) (pred_2 obj_11 obj_07)
   goals met: 1 of 3
6. (op_2 obj_11 obj_02 obj_12)
   deleted: (pred_4 obj_11 obj_02)
   added: (pred_4 obj_11 obj_12)
   goals met: 1 of 3
7. (op_3 obj_11 obj_04 obj_12 obj_07)
   deleted: (pred_3 obj_04 obj_12) (pred_2 obj_11 obj_07)
   added: (pred_1 obj_11 obj_04 obj_07)
   goals met: 1 of 3
8. (op_3 obj_11 obj_06 obj_12 obj_10)
   deleted: (pred_3 obj_06 obj_12) (pred_2 obj_11 obj_10)
   added: (pred_1 obj_11 obj_06 obj_10)
   goals met: 1 of 3
9. (op_2 obj_11 obj_12 obj_01)
   deleted: (pred_4 obj_11 obj_12)
   added: (pred_4 obj_11 obj_01)
   goals met: 1 of 3
10. (op_1 obj_11 obj_06 obj_01 obj_10)
   deleted: (pred_1 obj_11 obj_06 obj_10)
   added: (pred_3 obj_06 obj_01) (pred_2 obj_11 obj_10)
   goals met: 2 of 3
11. (op_1 obj_11 obj_04 obj_01 obj_07)
   deleted: (pred_1 obj_11 obj_04 obj_07)
   added: (pred_3 obj_04 obj_01) (pred_2 obj_11 obj_07)
   goals met: 3 of 3
